{
  "ACTIVE RECORD":"Active Record is the “M” in MVC. It is the model which is the layer of the system responsible for representing business data and logic.",
  "ANGULAR.JS":"Angular.js is an open-source web application framework maintained by Google.",
  "ALGORITHM":"An algorithm is a set of processes or rules to be followed in calculations or other problem-solving operations. Algorithms are the basis for most computer programming.",
  "AJAX":"AJAX stands for “asynchronous JavaScript and XML.” It is a set of web development techniques utilizing many web technologies on the client-side in order to create asynchronous web applications.",
  "APACHE":"Apache is an open source, Unix-based Web server. It was created by the Apache Software Foundation.",
  "API":"An API is an application programming interface. It is a set of routines, protocols, and tools for building software applications. API’s express software components in terms of their operations, inputs, outputs, and underlying types.",
  "AV FOUNDATION":"AVFoundation is a popular framework with an Objective-C interface. This makes AVFoundation easy to use with time-based audiovisual media on Apple Operating systems.",
  "BACKBONE.JS":"Backbone.js is a JavaScript framework with a RESTful JSON interface and is based on the model-view-presenter (MVP) application design paradigm.",
  "BOOTSTRAP":"Bootstrap is an open-source collection of tools for creating websites and web applications. It was developed by Mark Otto and Jacob Thornton of Twitter. It was created as a framework to encourage consistency across internal tools and was originally named “Twitter Blueprint”.",
  "BOOLEAN SEARCHING":"Boolean searching is built on a method of symbolic logic developed by George Boole, a 19th century English mathematician. Boolean searches allow you to combine words and phrases using the words and, or, not (Boolean operators) to limit, broaden, or define your search.",
  "CODEIGNITER":"Codeigniter is an open source rapid development web application framework, for use in building dynamic web sites with PHP.",
  "CODE REVIEW":"A code review is the systematic examination of computer source code. It is intended to find and fix mistakes originally overlooked.",
  "VERSION CONTROL":"Code version control is the management of changes to documents, computer programs, large web sites, and other collections of information. Changes are identified by a number or letter code, termed the “revision number",
  "COFFEESCRIPT":"CoffeeScript is a programming language that trans compiles to JavaScript.",
  "DATA STRUCTURES":"A data structure is a method of organization of data in a computer so that it can be used efficiently. Data structures can implement one or more particular abstract data types (ADT), which are the means of specifying the contract of operations and their complexity.",
  "DJANGO":"A free, open source, web application framework written in Python which follows the model-view-controller (MVC) framework",
  "DEPLOYMENT":"Software deployment is all of the activities that make a software system available for use.",
  "EXPRESS.JS":"Express.js is a Node.js web application server framework, designed for building single-page, multi-page, and hybrid web applications.",
  "FLASK":"A micro web application framework written in Python and based on the Werkzeug toolkit and Jinja2 template engine.",
  "FRAMEWORK":"A framework is often a layered structure indicating what kind of programs can or should be built and how they would interrelate.",
  "FULL STACK":"A full stack, also known as a software stack or bundle, is a set of software components needed to create a complete web application. A web application can be divided into two areas: front-end and back-end. The front-end contains client-side languages. The back-end consists of web servers, back-end languages / frameworks, and databases.",
  "GITHUB":"A micro web application framework written in Python and based on the Werkzeug toolkit and Jinja2 template engine.",
  "HAML":"(HTML Abstraction Markup Language) is a lightweight markup language that’s used to describe the HTML of a web document.",
  "HTML":"HyperText Markup Language, commonly referred to as HTML, is the standard markup language used to create web pages. This is often the very first technology beginners to web development will learn",
  "HTTP REQUEST":"HyperText Transfer Protocol is an application protocol for distributed, collaborative, hypermedia information systems. HTTP is the foundation of data communication for the World Wide Web.",
  "IOS SWIFT":"iOS Swift is a multi-paradigm, compiled programming language created by Apple Inc for iOS, OS X and watchOS and tvOS development. Swift is designed to work with Apple’s Cocoa and Cocoa Touch frameworks and the large body of existing Objective-C code written for Apple products.",
  "JQUERY":"jQuery is a cross-platform JavaScript library designed to simplify the client-side scripting of HTML. jQuery is the most popular JavaScript library in use today, with installation on 65% of the top 10 million highest-trafficked websites.",
  "LAMP STACK":"LAMP is an archetypal model of web service solution stacks: Linux operating system, the Apache HTTP Server, the MySQL relational database management system (RDBMS) and the PHP programming language.",
  "LESS":"LESS is a dynamic stylesheet language that can be compiled into Cascading Style Sheets (CSS) and run on the client-side or server-side.",
  "LINUX":"Linux is a unix-like computer operating system assembled under the model of free and open-source software development and distribution.",
  "LOCAL STORAGE":"The data placed in local storage is per origin (the combination of protocol, hostname, and port number as defined in the same-origin policy).",
  "MEAN STACK":"MEAN is a free and open-source JavaScript software stack for building dynamic websites and web applications. MEAN is a combination of MongoDB, Express.js and Angular.js; all of which is run upon Node.js.",
  "MONGODB":"MongoDB is a cross-platform document-oriented database. Classified as a NoSQL database, MongoDB eschews the traditional table-based relational database structure in favor of JSON-like documents with dynamic schemas.",
  "MVC":"Model-view-controller (MVC) is a software architectural pattern for implementing user interfaces. It divides a given software application into three interconnected parts, so as to separate the internal representations of information from the ways that information is presented to or accepted from the user.",
  "MYSQL":"MySQL is an open-source relational database management system (RDBMS).",
  "NODE.JS":"Node.js is an open-source, cross-platform runtime environment for developing server-side web applications. Node.js applications are written in JavaScript and can be run within the Node.js runtime on OS X, Microsoft Windows, Linux and many more systems.",
  "OBJECT ORIENTED PROGRAMING":"OOP is a programming paradigm based on the concepts of “objects,” which are data structures that contain data, in the form of fields, often known as attributes; and code, in the form of procedures, often known as methods.",
  "OBJECT RELATIONAL MAPPER":"ORM is a programming technique for converting data between incompatible type systems in object-oriented programming languages.",
  "PHP":"PHP is a server-side scripting language designed for web development but also used as a general purpose programming language.",
  "POSTGRESQL":"Postgres is an object-relational database management system (ORDBMS) with an emphasis on extensibility and on standards-compliance.",
  "PYTHON":"Python is a widely used general-purpose, high-level programming language. Its design philosophy emphasize code readability, and its syntax allows programmers to express concepts in fewer lines of code than would be possible in languages such as C++ or Java.",
  "SASS":"Sass is a scripting language that is interpreted into Cascading Style Sheets (CSS). SassScript is the scripting language itself, which consists of two syntaxes." 
}